Revit 2024 API
BuiltInFailures.SketchFailures.LinesOverlapError Property
 Cannot have overlapping lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LinesOverlapError { get; }
Visual Basic
Public Shared ReadOnly Property LinesOverlapError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LinesOverlapError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace